[
  {
    "name": "certifi",
    "version": "2020.4.5.2",
    "vulns": [
      {
        "id": "GHSA-43fp-rhv2-5gv8",
        "fix_versions": [
          "2022.12.7"
        ],
        "description": "Certifi 2022.12.07 removes root certificates from \"TrustCor\" from the root store. These are in the process of being removed from Mozilla's trust store.  TrustCor's root certificates are being removed pursuant to an investigation prompted by media reporting that TrustCor's ownership also operated a business that produced spyware. Conclusions of Mozilla's investigation can be found [here](https://groups.google.com/a/mozilla.org/g/dev-security-policy/c/oxX69KFvsm4/m/yLohoVqtCgAJ)."
      }
    ]
  },
  {
    "name": "cryptography",
    "version": "2.9.2",
    "vulns": [
      {
        "id": "PYSEC-2021-62",
        "fix_versions": [
          "3.2.1"
        ],
        "description": "python-cryptography 3.2 is vulnerable to Bleichenbacher timing attacks in the RSA decryption API, via timed processing of valid PKCS#1 v1.5 ciphertext."
      }
    ]
  },
  {
    "name": "future",
    "version": "0.18.2",
    "vulns": [
      {
        "id": "GHSA-v3c5-jqr6-7qm8",
        "fix_versions": [],
        "description": "An issue discovered in Python Charmers Future 0.18.2 and earlier allows remote attackers to cause a denial of service via crafted Set-Cookie header from malicious web server."
      }
    ]
  },
  {
    "name": "jinja2",
    "version": "2.10.3",
    "vulns": [
      {
        "id": "PYSEC-2021-66",
        "fix_versions": [
          "2.11.3"
        ],
        "description": "This affects the package jinja2 from 0.0.0 and before 2.11.3. The ReDoS vulnerability is mainly due to the `_punctuation_re regex` operator and its use of multiple wildcards. The last wildcard is the most exploitable as it searches for trailing punctuation. This issue can be mitigated by Markdown to format user content instead of the urlize filter, or by implementing request timeouts and limiting process memory."
      }
    ]
  },
  {
    "name": "paramiko",
    "version": "2.6.0",
    "vulns": [
      {
        "id": "PYSEC-2022-166",
        "fix_versions": [
          "2.9.3",
          "2.10.1"
        ],
        "description": "In Paramiko before 2.10.1, a race condition (between creation and chmod) in the write_private_key_file function could allow unauthorized information disclosure."
      }
    ]
  },
  {
    "name": "pyyaml",
    "version": "5.3.1",
    "vulns": [
      {
        "id": "PYSEC-2021-142",
        "fix_versions": [
          "5.4"
        ],
        "description": "A vulnerability was discovered in the PyYAML library in versions before 5.4, where it is susceptible to arbitrary code execution when it processes untrusted YAML files through the full_load method or with the FullLoader loader. Applications that use the library to process untrusted input may be vulnerable to this flaw. This flaw allows an attacker to execute arbitrary code on the system by abusing the python/object/new constructor. This flaw is due to an incomplete fix for CVE-2020-1747."
      }
    ]
  },
  {
    "name": "urllib3",
    "version": "1.25.9",
    "vulns": [
      {
        "id": "PYSEC-2021-108",
        "fix_versions": [
          "1.26.5"
        ],
        "description": "An issue was discovered in urllib3 before 1.26.5. When provided with a URL containing many @ characters in the authority component, the authority regular expression exhibits catastrophic backtracking, causing a denial of service if a URL were passed as a parameter or redirected to via an HTTP redirect."
      }
    ]
  },
  {
    "name": "wheel",
    "version": "0.34.2",
    "vulns": [
      {
        "id": "GHSA-qwmp-2cf2-g9g6",
        "fix_versions": [
          "0.38.1"
        ],
        "description": "Python Packaging Authority (PyPA) Wheel is a reference implementation of the Python wheel packaging standard. Wheel 0.37.1 and earlier are vulnerable to a Regular Expression denial of service via attacker controlled input to the wheel cli. The vulnerable regex is used to verify the validity of Wheel file names. This has been patched in version 0.38.1."
      }
    ]
  }
]